Backend/tests/load-test.yml
# Artillery.io Load Test — Walk N Earn
# Targets: GET /api/leaderboard/top  and  POST /api/rewards/redeem
#
# Prerequisites:
#   npm install -g artillery
#   Set TEST_TOKEN env var: export TEST_TOKEN="<valid JWT>"
#   Set TEST_REWARD_ID env var: export TEST_REWARD_ID="<valid rewardId>"
#
# Run: artillery run Backend/tests/load-test.yml

config:
  target: "http://localhost:5000"
  environments:
    # Quick smoke test – low traffic
    smoke:
      phases:
        - duration: 10
          arrivalRate: 1
          name: Smoke test
    # Standard load test
    load:
      phases:
        - duration: 30
          arrivalRate: 5
          name: Warm-up
        - duration: 60
          arrivalRate: 20
          name: Sustained load
        - duration: 20
          arrivalRate: 50
          name: Peak load
  # Reuse the JWT across all requests
  variables:
    token: "{{ $env.TEST_TOKEN }}"
    rewardId: "{{ $env.TEST_REWARD_ID }}"
  # Thresholds – test fails if p95 latency > 500 ms or error rate > 1 %
  ensure:
    p95: 500
    maxErrorRate: 1

scenarios:
  # ── Scenario 1: Read leaderboard (unauthenticated, high-frequency) ──────────
  - name: "GET weekly leaderboard top 10"
    weight: 70
    flow:
      - get:
          url: "/api/leaderboard/top"
          expect:
            - statusCode: 200

  # ── Scenario 2: Read active rewards (unauthenticated) ───────────────────────
  - name: "GET active rewards"
    weight: 20
    flow:
      - get:
          url: "/api/rewards/active"
          expect:
            - statusCode: 200

  # ── Scenario 3: Attempt redemption (authenticated) ──────────────────────────
  # NOTE: Uses the same token; in production use a token pool to avoid
  #       exhausting a single user's points.
  - name: "POST redeem reward"
    weight: 10
    flow:
      - post:
          url: "/api/rewards/redeem"
          headers:
            Authorization: "Bearer {{ token }}"
            Content-Type: "application/json"
          json:
            rewardId: "{{ rewardId }}"
          # 200 = success, 400 = not enough points / out of stock (expected under load)
          expect:
            - statusCode:
                - 200
                - 400
                - 403